cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF40xR.xml
        <!-- REGISTER "OCU_OCSB10" -->
        <register>
          <name>OCU_OCSB10</name>
          <description>"OCU ch.1,0 Control Register B"</description>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x60</resetValue>
          <resetMask>0x73</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OTD0" -->
            <field>
              <name>OTD0</name>
              <description>Indicates that the RT(0) output pin is in the High-level output state. </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OTD1" -->
            <field>
              <name>OTD1</name>
              <description>Indicates that the RT(1) output pin is in the High-level output state.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMOD" -->
            <field>
              <name>CMOD</name>
              <description>selects OCU's operation mode in combination with OCSC.MOD0 to MOD5</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTS0" -->
            <field>
              <name>BTS0</name>
              <description>Performs buffer transfer of the OCCP(0) register upon Peak value detection by FRT</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTS1" -->
            <field>
              <name>BTS1</name>
              <description>Performs buffer transfer of the OCCP(1) register upon Peak value detection by FRT</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSB32" -->
        <register derivedFrom="OCU_OCSB10">
          <name>OCU_OCSB32</name>
          <description>"OCU ch.3,2 Control Register B"</description>
          <addressOffset>0x1D</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSB54" -->
        <register derivedFrom="OCU_OCSB10">
          <name>OCU_OCSB54</name>
          <description>"OCU ch.5,4 Control Register B"</description>
          <addressOffset>0x21</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSC" -->
        <register>
          <name>OCU_OCSC</name>
          <description>OCU Control Register C</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3F00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MOD0" -->
            <field>
              <name>MOD0</name>
              <description>OCSC.MOD0 and OCSC.MOD1 determine the operation mode of OCU ch.0/ch.1 in combination with OCSB10.CMOD</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD1" -->
            <field>
              <name>MOD1</name>
              <description>OCSC.MOD0 and OCSC.MOD1 determine the operation mode of OCU ch.0/ch.1 in combination with OCSB10.CMOD</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD2" -->
            <field>
              <name>MOD2</name>
              <description>OCSC.MOD2 and OCSC.MOD3 determine the operation mode of OCU ch.2/ch.3 in combination with OCSB32.CMOD</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD3" -->
            <field>
              <name>MOD3</name>
              <description>OCSC.MOD2 and OCSC.MOD3 determine the operation mode of OCU ch.2/ch.3 in combination with OCSB32.CMOD</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD4" -->
            <field>
              <name>MOD4</name>
              <description>OCSC.MOD4 and OCSC.MOD5 determine the operation mode of OCU ch.4/ch.5 in combination with OCSB54.CMOD</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD5" -->
            <field>
              <name>MOD5</name>
              <description>OCSC.MOD4 and OCSC.MOD5 determine the operation mode of OCU ch.4/ch.5 in combination with OCSB54.CMOD</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCCP0" -->
        <register>
          <name>OCU_OCCP0</name>
          <description>OCU ch.0 Compare Value Store Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "OCU_OCCP1" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP1</name>
          <description>OCU ch.1 Compare Value Store Register</description>
          <addressOffset>0x4</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP2" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP2</name>
          <description>OCU ch.2 Compare Value Store Register</description>
          <addressOffset>0x8</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP3" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP3</name>
          <description>OCU ch.3 Compare Value Store Register</description>
          <addressOffset>0xC</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP4" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP4</name>
          <description>OCU ch.4 Compare Value Store Register</description>
          <addressOffset>0x10</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP5" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP5</name>
          <description>OCU ch.5 Compare Value Store Register</description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "WFG_WFSA10" -->
        <register>
          <name>WFG_WFSA10</name>
          <description>WFG ch.10 Control Register A</description>
          <addressOffset>0x8C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x1FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DCK" -->
            <field>
              <name>DCK</name>
              <description>clock cycle of the WFG timer</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMD" -->
            <field>
              <name>TMD</name>
              <description>WFG's operation mode</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GTEN" -->
            <field>
              <name>GTEN</name>
              <description>the CH_GATE signal for each channel of WFG</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PSEL" -->
            <field>
              <name>PSEL</name>
              <description>the PPG timer unit to be used at each channel of WFG</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PGEN" -->
            <field>
              <name>PGEN</name>
              <description>specifies how to reflect the CH_PPG signal that is input to each channel of WFG on WFG output</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMOD" -->
            <field>
              <name>DMOD</name>
              <description>specifies which polarity will be used to output the non-overlap signal</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFG_WFSA32" -->
        <register derivedFrom="WFG_WFSA10">
          <name>WFG_WFSA32</name>
          <description>WFG ch.32 Control Register A</description>
          <addressOffset>0x90</addressOffset>
        </register>
